{"format": "layers-model", "generatedBy": "keras v3.3.3", "convertedBy": "TensorFlow.js Converter v4.20.0", "modelTopology": {"keras_version": "3.3.3", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "functional_1", "trainable": true, "layers": [{"class_name": "InputLayer", "config": {"batch_shape": [null, 100], "dtype": "float32", "sparse": false, "name": "desc_input"}, "name": "desc_input", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_shape": [null, 10], "dtype": "float32", "sparse": false, "name": "acc_input"}, "name": "acc_input", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_shape": [null, 5], "dtype": "float32", "sparse": false, "name": "type_input"}, "name": "type_input", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_shape": [null, 20], "dtype": "float32", "sparse": false, "name": "fac_input"}, "name": "fac_input", "inbound_nodes": []}, {"class_name": "Embedding", "config": {"name": "desc_embedding", "trainable": true, "dtype": "float32", "input_dim": 10000, "output_dim": 64, "embeddings_initializer": {"module": "keras.initializers", "class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "registered_name": null}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false}, "name": "desc_embedding", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 100], "dtype": "float32", "keras_history": ["desc_input", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Embedding", "config": {"name": "acc_embedding", "trainable": true, "dtype": "float32", "input_dim": 1000, "output_dim": 32, "embeddings_initializer": {"module": "keras.initializers", "class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "registered_name": null}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false}, "name": "acc_embedding", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 10], "dtype": "float32", "keras_history": ["acc_input", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Embedding", "config": {"name": "type_embedding", "trainable": true, "dtype": "float32", "input_dim": 100, "output_dim": 16, "embeddings_initializer": {"module": "keras.initializers", "class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "registered_name": null}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false}, "name": "type_embedding", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 5], "dtype": "float32", "keras_history": ["type_input", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Embedding", "config": {"name": "fac_embedding", "trainable": true, "dtype": "float32", "input_dim": 1000, "output_dim": 32, "embeddings_initializer": {"module": "keras.initializers", "class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "registered_name": null}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false}, "name": "fac_embedding", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 20], "dtype": "float32", "keras_history": ["fac_input", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 100, 64], "dtype": "float32", "keras_history": ["desc_embedding", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_1", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 10, 32], "dtype": "float32", "keras_history": ["acc_embedding", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Flatten", "config": {"name": "flatten_2", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_2", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 5, 16], "dtype": "float32", "keras_history": ["type_embedding", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Flatten", "config": {"name": "flatten_3", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_3", "inbound_nodes": [{"args": [{"class_name": "__keras_tensor__", "config": {"shape": [null, 20, 32], "dtype": "float32", "keras_history": ["fac_embedding", 0, 0]}}], "kwargs": {}}]}, {"class_name": "Concatenate", "config": {"name": "concatenate", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate", "inbound_nodes": [{"args": [[{"class_name": "__keras_tensor__", "config": {"shape": [null, 6400], "dtype": "float32", "keras_history": ["flatten", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 320], "dtype": "float32", "keras_history": ["flatten_1", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 80], "dtype": "float32", "keras_history": ["flatten_2", 0, 0]}}, {"class_name": "__keras_tensor__", "config": {"shape": [null, 640], "dtype": "float32", "keras_history": ["flatten_3", 0, 0]}}]], "kwargs": {}}]}], "input_layers": [["desc_input", 0, 0], ["acc_input", 0, 0], ["type_input", 0, 0], ["fac_input", 0, 0]], "output_layers": [["concatenate", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "acc_embedding/embeddings", "shape": [1000, 32], "dtype": "float32"}, {"name": "desc_embedding/embeddings", "shape": [10000, 64], "dtype": "float32"}, {"name": "fac_embedding/embeddings", "shape": [1000, 32], "dtype": "float32"}, {"name": "type_embedding/embeddings", "shape": [100, 16], "dtype": "float32"}]}]}