{"format": "layers-model", "generatedBy": "keras v2.15.0", "convertedBy": "TensorFlow.js Converter v4.20.0", "modelTopology": {"keras_version": "2.15.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model_2", "trainable": true, "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 100], "dtype": "float32", "sparse": false, "ragged": false, "name": "desc_input"}, "name": "desc_input", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 10], "dtype": "float32", "sparse": false, "ragged": false, "name": "acc_input"}, "name": "acc_input", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 5], "dtype": "float32", "sparse": false, "ragged": false, "name": "type_input"}, "name": "type_input", "inbound_nodes": []}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 20], "dtype": "float32", "sparse": false, "ragged": false, "name": "fac_input"}, "name": "fac_input", "inbound_nodes": []}, {"class_name": "Embedding", "config": {"name": "desc_embedding", "trainable": true, "dtype": "float32", "batch_input_shape": [null, 100], "input_dim": 10000, "output_dim": 64, "embeddings_initializer": {"module": "keras.initializers", "class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "registered_name": null}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 100}, "name": "desc_embedding", "inbound_nodes": [[["desc_input", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "acc_embedding", "trainable": true, "dtype": "float32", "batch_input_shape": [null, 10], "input_dim": 1000, "output_dim": 32, "embeddings_initializer": {"module": "keras.initializers", "class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "registered_name": null}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 10}, "name": "acc_embedding", "inbound_nodes": [[["acc_input", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "type_embedding", "trainable": true, "dtype": "float32", "batch_input_shape": [null, 5], "input_dim": 100, "output_dim": 16, "embeddings_initializer": {"module": "keras.initializers", "class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "registered_name": null}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 5}, "name": "type_embedding", "inbound_nodes": [[["type_input", 0, 0, {}]]]}, {"class_name": "Embedding", "config": {"name": "fac_embedding", "trainable": true, "dtype": "float32", "batch_input_shape": [null, 20], "input_dim": 1000, "output_dim": 32, "embeddings_initializer": {"module": "keras.initializers", "class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "registered_name": null}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 20}, "name": "fac_embedding", "inbound_nodes": [[["fac_input", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_8", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_8", "inbound_nodes": [[["desc_embedding", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_9", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_9", "inbound_nodes": [[["acc_embedding", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_10", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_10", "inbound_nodes": [[["type_embedding", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "flatten_11", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "flatten_11", "inbound_nodes": [[["fac_embedding", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_2", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate_2", "inbound_nodes": [[["flatten_8", 0, 0, {}], ["flatten_9", 0, 0, {}], ["flatten_10", 0, 0, {}], ["flatten_11", 0, 0, {}]]]}], "input_layers": [["desc_input", 0, 0], ["acc_input", 0, 0], ["type_input", 0, 0], ["fac_input", 0, 0]], "output_layers": [["concatenate_2", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "acc_embedding/embeddings", "shape": [1000, 32], "dtype": "float32"}, {"name": "desc_embedding/embeddings", "shape": [10000, 64], "dtype": "float32"}, {"name": "fac_embedding/embeddings", "shape": [1000, 32], "dtype": "float32"}, {"name": "type_embedding/embeddings", "shape": [100, 16], "dtype": "float32"}]}]}