{"format": "graph-model", "generatedBy": "2.16.1", "convertedBy": "TensorFlow.js Converter v4.20.0", "signature": {"inputs": {"inputs_1": {"name": "inputs_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "10"}]}}, "inputs_3": {"name": "inputs_3:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "20"}]}}, "inputs": {"name": "inputs:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "100"}]}}, "inputs_2": {"name": "inputs_2:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "5"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "7440"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/model_1/desc_embedding_1/GatherV2/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10000"}, {"size": "64"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/desc_embedding_1/Less/y", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_1/desc_embedding_1/strided_slice", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_1/desc_embedding_1/GatherV2/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_1/flatten_1/Reshape/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/acc_embedding_1/GatherV2/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1000"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/acc_embedding_1/Less/y", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_1/acc_embedding_1/strided_slice", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/acc_embedding_1/GatherV2/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_1/flatten_1_2/Reshape/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/type_embedding_1/GatherV2/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "100"}, {"size": "16"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/type_embedding_1/Less/y", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_1/type_embedding_1/strided_slice", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_1/type_embedding_1/GatherV2/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_1/flatten_2_1/Reshape/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/fac_embedding_1/GatherV2/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1000"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/fac_embedding_1/Less/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/fac_embedding_1/strided_slice", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_1/fac_embedding_1/GatherV2/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/model_1/flatten_3_1/Reshape/shape", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}}}, {"name": "StatefulPartitionedCall/model_1/concatenate_1/concat/axis", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "inputs", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "100"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "inputs_1", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "10"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "inputs_2", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "5"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "inputs_3", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "20"}]}}}}, {"name": "StatefulPartitionedCall/model_1/desc_embedding_1/Cast", "op": "Cast", "input": ["inputs"], "attr": {"DstT": {"type": "DT_INT32"}, "Truncate": {"b": false}, "SrcT": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/acc_embedding_1/Cast", "op": "Cast", "input": ["inputs_1"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_INT32"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/model_1/type_embedding_1/Cast", "op": "Cast", "input": ["inputs_2"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "DstT": {"type": "DT_INT32"}, "Truncate": {"b": false}}}, {"name": "StatefulPartitionedCall/model_1/fac_embedding_1/Cast", "op": "Cast", "input": ["inputs_3"], "attr": {"SrcT": {"type": "DT_FLOAT"}, "Truncate": {"b": false}, "DstT": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/desc_embedding_1/Less", "op": "Less", "input": ["StatefulPartitionedCall/model_1/desc_embedding_1/Cast", "StatefulPartitionedCall/model_1/desc_embedding_1/Less/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/desc_embedding_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/model_1/desc_embedding_1/Cast", "StatefulPartitionedCall/model_1/desc_embedding_1/strided_slice"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/acc_embedding_1/Less", "op": "Less", "input": ["StatefulPartitionedCall/model_1/acc_embedding_1/Cast", "StatefulPartitionedCall/model_1/acc_embedding_1/Less/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/acc_embedding_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/model_1/acc_embedding_1/Cast", "StatefulPartitionedCall/model_1/acc_embedding_1/strided_slice"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/type_embedding_1/Less", "op": "Less", "input": ["StatefulPartitionedCall/model_1/type_embedding_1/Cast", "StatefulPartitionedCall/model_1/type_embedding_1/Less/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/type_embedding_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/model_1/type_embedding_1/Cast", "StatefulPartitionedCall/model_1/type_embedding_1/strided_slice"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/fac_embedding_1/Less", "op": "Less", "input": ["StatefulPartitionedCall/model_1/fac_embedding_1/Cast", "StatefulPartitionedCall/model_1/fac_embedding_1/Less/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/fac_embedding_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/model_1/fac_embedding_1/Cast", "StatefulPartitionedCall/model_1/fac_embedding_1/strided_slice"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/desc_embedding_1/SelectV2", "op": "SelectV2", "input": ["StatefulPartitionedCall/model_1/desc_embedding_1/Less", "StatefulPartitionedCall/model_1/desc_embedding_1/add", "StatefulPartitionedCall/model_1/desc_embedding_1/Cast"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/acc_embedding_1/SelectV2", "op": "SelectV2", "input": ["StatefulPartitionedCall/model_1/acc_embedding_1/Less", "StatefulPartitionedCall/model_1/acc_embedding_1/add", "StatefulPartitionedCall/model_1/acc_embedding_1/Cast"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/type_embedding_1/SelectV2", "op": "SelectV2", "input": ["StatefulPartitionedCall/model_1/type_embedding_1/Less", "StatefulPartitionedCall/model_1/type_embedding_1/add", "StatefulPartitionedCall/model_1/type_embedding_1/Cast"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/fac_embedding_1/SelectV2", "op": "SelectV2", "input": ["StatefulPartitionedCall/model_1/fac_embedding_1/Less", "StatefulPartitionedCall/model_1/fac_embedding_1/add", "StatefulPartitionedCall/model_1/fac_embedding_1/Cast"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/desc_embedding_1/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/model_1/desc_embedding_1/GatherV2/ReadVariableOp", "StatefulPartitionedCall/model_1/desc_embedding_1/SelectV2", "StatefulPartitionedCall/model_1/desc_embedding_1/GatherV2/axis"], "attr": {"Tindices": {"type": "DT_INT32"}, "Taxis": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "Tparams": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/acc_embedding_1/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/model_1/acc_embedding_1/GatherV2/ReadVariableOp", "StatefulPartitionedCall/model_1/acc_embedding_1/SelectV2", "StatefulPartitionedCall/model_1/acc_embedding_1/GatherV2/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "Tparams": {"type": "DT_FLOAT"}, "batch_dims": {"i": "0"}, "Tindices": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/type_embedding_1/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/model_1/type_embedding_1/GatherV2/ReadVariableOp", "StatefulPartitionedCall/model_1/type_embedding_1/SelectV2", "StatefulPartitionedCall/model_1/type_embedding_1/GatherV2/axis"], "attr": {"Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "Tparams": {"type": "DT_FLOAT"}, "Taxis": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/fac_embedding_1/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/model_1/fac_embedding_1/GatherV2/ReadVariableOp", "StatefulPartitionedCall/model_1/fac_embedding_1/SelectV2", "StatefulPartitionedCall/model_1/fac_embedding_1/GatherV2/axis"], "attr": {"Tparams": {"type": "DT_FLOAT"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}, "Taxis": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/flatten_1/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/model_1/desc_embedding_1/GatherV2", "StatefulPartitionedCall/model_1/flatten_1/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model_1/flatten_1_2/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/model_1/acc_embedding_1/GatherV2", "StatefulPartitionedCall/model_1/flatten_1_2/Reshape/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/flatten_2_1/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/model_1/type_embedding_1/GatherV2", "StatefulPartitionedCall/model_1/flatten_2_1/Reshape/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/flatten_3_1/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/model_1/fac_embedding_1/GatherV2", "StatefulPartitionedCall/model_1/flatten_3_1/Reshape/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model_1/concatenate_1/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/model_1/flatten_1/Reshape", "StatefulPartitionedCall/model_1/flatten_1_2/Reshape", "StatefulPartitionedCall/model_1/flatten_2_1/Reshape", "StatefulPartitionedCall/model_1/flatten_3_1/Reshape", "StatefulPartitionedCall/model_1/concatenate_1/concat/axis"], "attr": {"T": {"type": "DT_FLOAT"}, "N": {"i": "4"}, "Tidx": {"type": "DT_INT32"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/model_1/concatenate_1/concat"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1766}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/model_1/desc_embedding_1/GatherV2/ReadVariableOp", "shape": [10000, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_1/desc_embedding_1/Less/y", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_1/desc_embedding_1/strided_slice", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_1/desc_embedding_1/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_1/flatten_1/Reshape/shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_1/acc_embedding_1/GatherV2/ReadVariableOp", "shape": [1000, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_1/acc_embedding_1/Less/y", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_1/acc_embedding_1/strided_slice", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_1/acc_embedding_1/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_1/flatten_1_2/Reshape/shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_1/type_embedding_1/GatherV2/ReadVariableOp", "shape": [100, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_1/type_embedding_1/Less/y", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_1/type_embedding_1/strided_slice", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_1/type_embedding_1/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_1/flatten_2_1/Reshape/shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_1/fac_embedding_1/GatherV2/ReadVariableOp", "shape": [1000, 32], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model_1/fac_embedding_1/Less/y", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_1/fac_embedding_1/strided_slice", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_1/fac_embedding_1/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_1/flatten_3_1/Reshape/shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model_1/concatenate_1/concat/axis", "shape": [], "dtype": "int32"}]}]}